<a href="https://colab.research.google.com/github/AbhimanyuMandal/Machine-Learning/blob/main/Decision%20Tree%20titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [25]:
import pandas as pd

In [26]:
df = pd.read_csv("titanic.csv")
df

     Pclass     Sex   Age     Fare  Survived
0         3    male  22.0   7.2500         0
1         1  female  38.0  71.2833         1
2         3  female  26.0   7.9250         1
3         1  female  35.0  53.1000         1
4         3    male  35.0   8.0500         0
..      ...     ...   ...      ...       ...
886       2    male  27.0  13.0000         0
887       1  female  19.0  30.0000         1
888       3  female   NaN  23.4500         0
889       1    male  26.0  30.0000         1
890       3    male  32.0   7.7500         0

[891 rows x 5 columns]

Data preprocessing

In [27]:
import math
age_mean = math.floor(df['Age'].mean())
age_mean

29

In [28]:
df['Age'] = df['Age'].fillna(age_mean)
df

     Pclass     Sex   Age     Fare  Survived
0         3    male  22.0   7.2500         0
1         1  female  38.0  71.2833         1
2         3  female  26.0   7.9250         1
3         1  female  35.0  53.1000         1
4         3    male  35.0   8.0500         0
..      ...     ...   ...      ...       ...
886       2    male  27.0  13.0000         0
887       1  female  19.0  30.0000         1
888       3  female  29.0  23.4500         0
889       1    male  26.0  30.0000         1
890       3    male  32.0   7.7500         0

[891 rows x 5 columns]

In [29]:
input = df.drop('Survived',axis='columns')
target = df['Survived']

In [30]:
input

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female  29.0  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [31]:
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [32]:
from sklearn.preprocessing import LabelEncoder

In [33]:
le_Sex = LabelEncoder()

In [34]:
input['Sex_n'] = le_Sex.fit_transform(input['Sex'])
input.head()

   Pclass     Sex   Age     Fare  Sex_n
0       3    male  22.0   7.2500      1
1       1  female  38.0  71.2833      0
2       3  female  26.0   7.9250      0
3       1  female  35.0  53.1000      0
4       3    male  35.0   8.0500      1

In [35]:
input_n = input.drop(['Sex'],axis='columns')
input_n

     Pclass   Age     Fare  Sex_n
0         3  22.0   7.2500      1
1         1  38.0  71.2833      0
2         3  26.0   7.9250      0
3         1  35.0  53.1000      0
4         3  35.0   8.0500      1
..      ...   ...      ...    ...
886       2  27.0  13.0000      1
887       1  19.0  30.0000      0
888       3  29.0  23.4500      0
889       1  26.0  30.0000      1
890       3  32.0   7.7500      1

[891 rows x 4 columns]

In [43]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(input_n, target, test_size = 0.2)

In [51]:
x_train

     Pclass   Age      Fare  Sex_n
331       1  45.5   28.5000      1
733       2  23.0   13.0000      1
382       3  32.0    7.9250      1
704       3  26.0    7.8542      1
813       3   6.0   31.2750      0
..      ...   ...       ...    ...
106       3  21.0    7.6500      0
270       1  29.0   31.0000      1
860       3  41.0   14.1083      1
435       1  14.0  120.0000      0
102       1  21.0   77.2875      1

[712 rows x 4 columns]

In [52]:
y_train

331    0
733    0
382    0
704    0
813    0
      ..
106    1
270    0
860    0
435    1
102    0
Name: Survived, Length: 712, dtype: int64

In [53]:
x_test

     Pclass   Age     Fare  Sex_n
709       3  29.0  15.2458      1
439       2  31.0  10.5000      1
840       3  20.0   7.9250      1
720       2   6.0  33.0000      0
39        3  14.0  11.2417      0
..      ...   ...      ...    ...
433       3  17.0   7.1250      1
773       3  29.0   7.2250      1
25        3  38.0  31.3875      0
84        2  17.0  10.5000      0
10        3   4.0  16.7000      0

[179 rows x 4 columns]

In [54]:
y_test

709    1
439    0
840    0
720    1
39     1
      ..
433    0
773    0
25     1
84     1
10     1
Name: Survived, Length: 179, dtype: int64

In [55]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [56]:
model.fit(x_train,y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [59]:
model.score(x_test,y_test)

0.770949720670391